{
  "_createdAt": "2025-05-29T12:56:24Z",
  "_id": "0ca11cee-c74d-497c-98c9-72daa83bc434",
  "_rev": "AtkzbEDC8k77XY1rGHg9Gk",
  "_type": "page",
  "_updatedAt": "2025-05-29T12:57:30Z",
  "body": [
    {
      "_key": "5b2680b499aa",
      "_type": "block",
      "children": [
        {
          "_key": "db556dcd1ed8",
          "_type": "span",
          "text": "Remembering Antoinette"
        }
      ],
      "style": "h1"
    },
    {
      "_key": "aab783e50720",
      "_type": "block",
      "children": [
        {
          "_key": "2b04b9bcdaa3",
          "_type": "span",
          "text": "This page is a tribute to my mother, who died of old age. I used to joke with her because she was 90 years old and didn’t have anything wrong with her. I told her she was going to live forever at this rate. Boy, was I wrong! She eventually developed a condition where she couldn’t swallow. Her esophagus eventually got weaker and weaker until she couldn’t ingest enough nourishment to sustain her life. She passed away on January 23, 2006, at 7:45 PM. Her four children were with her—three physically by her side and one on the phone—along with several grandchildren, including Lisa, who had cared for her and been her nearly constant companion for the past seven months. She passed very peacefully. This page is not about the mourning of her death but rather a celebration of her life."
        }
      ],
      "style": "normal"
    },
    {
      "_key": "837a5356c348",
      "_type": "image",
      "alt": "Antoinette 'Bobby' Rofrano (1915–2006)",
      "asset": {
        "_ref": "image-fc29b52f2549c184d3e74589e8567ebfbd94a381-1800x1200-png",
        "_type": "reference"
      }
    },
    {
      "_key": "4896f01485e1",
      "_type": "block",
      "children": [
        {
          "_key": "5e260ee701b9",
          "_type": "span",
          "text": "Honoring Her Memory"
        }
      ],
      "style": "h2"
    },
    {
      "_key": "3c573b1753f2",
      "_type": "block",
      "children": [
        {
          "_key": "e84662e69964",
          "_type": "span",
          "text": "My mother’s funeral was befitting of a queen. We celebrated her life at St. John the Evangelist Church in Schenectady, NY, a church as grand as a cathedral. The ceilings went up forever, and everywhere you looked was marble. The seating was like an amphitheater, and the altar was magnificent. Her granddaughter Lisa, who has taken care of her for the past seven months, did the bible reading from the Old Testament, and her eldest granddaughter Jennifer did the New Testament reading. Her eldest grandson, Vincent, read the General Intercessions, and two of her great-grandchildren, Briana and Michael, brought up the offertory gifts. The pastor even asked me to assist with communion. I had mentioned that I was a Eucharistic Minister, but I never expected to be in the Mass. It came as a complete surprise."
        }
      ],
      "style": "normal"
    },
    {
      "_key": "c182ff04e225",
      "_type": "block",
      "children": [
        {
          "_key": "6836dd50297f",
          "_type": "span",
          "text": "Many who attended told me it was a true celebration of her life and not a funeral. It was the greatest compliment they could have given me. I’m sure my father was smiling down upon me. I was only trying to do what he would have done had he been alive."
        }
      ],
      "style": "normal"
    },
    {
      "_key": "765ed0141174",
      "_type": "block",
      "children": [
        {
          "_key": "9d6f664a88cc",
          "_type": "span",
          "text": "Mom and Dad are together again. Be sure to visit Bobby’s Kitchen. (short video)"
        }
      ],
      "style": "normal"
    },
    {
      "_key": "c22039a9423a",
      "_type": "block",
      "children": [
        {
          "_key": "3ef02b88102b",
          "_type": "span",
          "text": "Eulogy"
        }
      ],
      "style": "h2"
    },
    {
      "_key": "cb44a92fb1b6",
      "_type": "block",
      "children": [
        {
          "_key": "9e4757cc251c",
          "_type": "span",
          "text": "Here is the eulogy I wrote for my mother. The pastor read most of it, and since he was Italian too, he relayed that he understood what it’s like to have an Italian mother:"
        }
      ],
      "style": "normal"
    },
    {
      "_key": "cf75d48aaa8c",
      "_type": "block",
      "children": [
        {
          "_key": "c2939f5b7c04",
          "_type": "span",
          "text": "I know Mom is smiling down on us today. She always smiled when her family was together. The family was at the core of who mom was. She wasn’t much for social events. She wasn’t much for politics. She didn’t watch soap operas. She only cared and nurtured her family in the utmost manner she knew how. Every Sunday, she would get up early to attend Mass so that she could come home and start cooking the Sunday dinner by 9:00 AM. A big pot of gravy would always be simmering on the stove, cooking and cooking. Somehow, Dad always found a way to steal a few fried meatballs before they made it into the gravy. On special occasions, she would make homemade macaroni. The whole family would make homemade Ravioli, with each member taking their part in a giant assembly line that started in the kitchen and ended on a white floured sheet in the bedroom."
        }
      ],
      "style": "normal"
    },
    {
      "_key": "34b5d27e7906",
      "_type": "block",
      "children": [
        {
          "_key": "4d29312f994b",
          "_type": "span",
          "text": "To Mom, food was love. When I asked her grandchildren for memories of their grandmother, they all agreed that the three words she said most often were, “Eat, eat, eat.” It was her way of saying, “I love you, I love you, I love you.” She could whip up a gourmet meal on a moment’s notice out of what was in the refrigerator and proclaim, “Oh, it’s so simple to do.” So many memories they had of her were about food and, therefore, of her love. Love for her husband, her children, and her grandchildren and great-grandchildren. The Pizzelles, the homemade Ravioli, the polenta, the Spaghetti Aglio e Olio, the Cheesecake, the Easter bread, the Christmas cookies, and the list goes on and on. Mom sure knew how to cook up a lot of love."
        }
      ],
      "style": "normal"
    },
    {
      "_key": "22cb0253fd36",
      "_type": "block",
      "children": [
        {
          "_key": "af0e689e5cb2",
          "_type": "span",
          "text": "We should remember today not to mourn her passing but to celebrate her life. Her life as a loving grandmother and great-grandmother to so many of you sitting here. Her life as a mother who did her best to guide her children in the right direction. Her life as a dedicated wife and companion of 56 years to Dad, who loved her just as deeply. I knew Mom & Dad loved to dance, and today, they are together again, dancing in heaven. Let us be happy for them and for the privilege to have known our mom, Antoinette Rofrano, and have been touched by her life."
        }
      ],
      "style": "normal"
    },
    {
      "_key": "506d410eeb91",
      "_type": "block",
      "children": [
        {
          "_key": "ced8c6edb65c",
          "_type": "span",
          "text": "A Life Goal"
        }
      ],
      "style": "h2"
    },
    {
      "_key": "e4167e194811",
      "_type": "block",
      "children": [
        {
          "_key": "13fe80adec41",
          "_type": "span",
          "text": "I regret that my father didn’t live long enough to see me achieve one of my lifelong goals. Writing a book. I don’t know what it was about writing a book that intrigued me, but I always felt I had information to share on several topics, and it would be great to document it in a book. I was fortunate to achieve that goal in January 2005 while my mother was still alive to celebrate this milestone with me."
        }
      ],
      "style": "normal"
    },
    {
      "_key": "e3243f74c1c6",
      "_type": "block",
      "children": [
        {
          "_key": "705163bfa9c0",
          "_type": "span",
          "text": "This photo of my mother and me was taken on February 15, 2005, when I showed her my first book. I remember her looking through the pages at all the pictures, and I was trying to explain to her that it was an instructional book on music software. She just kept looking and looking and then looked up at me with a smile like she was very proud."
        }
      ],
      "style": "normal"
    },
    {
      "_key": "2a66e9d9d424",
      "_type": "block",
      "children": [
        {
          "_key": "a4f6a235eabf",
          "_type": "span",
          "text": "My next lifelong goal is to live to be 90, just like my mother. 😉"
        }
      ],
      "style": "normal"
    }
  ],
  "changeFrequency": "monthly",
  "description": "Antoinette owned and operated Bobbys Beauty Shoppe at 177 South Broadway, Yonkers until 1946 where she was given the nickname Bobby. She was predeceased by her husband John J. Rofrano; they were married 56 years at the time of his death in 2001. Mrs. Rofrano is survived by three daughters and a son, 13 grandchildren and ten great grandchildren. She is also survived by three sisters, Sadie Berardis of Yonkers, Betty DeMichele of Boynton Beach, FL, and Jean DeMarco of Suffern; and nieces and nephews. (Information paraphrased from The Daily Gazette) 1/26/06",
  "lastModified": "2025-05-29T12:56:20Z",
  "priority": 0.5,
  "slug": "bobby",
  "title": "Antoinette “Bobby” Rofrano"
}