{
  "_createdAt": "2025-05-29T12:58:59Z",
  "_id": "65e89074-38f3-45f5-b19f-9dfa289e58e6",
  "_rev": "xm0cf6bgI7hUefqjhJ9aNL",
  "_type": "page",
  "_updatedAt": "2025-05-29T13:00:13Z",
  "body": [
    {
      "_key": "9ddaf07e9e4b",
      "_type": "block",
      "children": [
        {
          "_key": "57189e1cb174",
          "_type": "span",
          "text": "Remembering John"
        }
      ],
      "style": "h1"
    },
    {
      "_key": "e749daf64706",
      "_type": "block",
      "children": [
        {
          "_key": "7332a27b500e",
          "_type": "span",
          "text": "This page is a tribute to my father, who died of bone cancer on November 18, 2001, at 3:23 AM. His four children were by his side, and he passed very peacefully. He fought a hard fight, but in the end, the cancer won. This page is not about the mourning of her death but rather a celebration of her life."
        }
      ],
      "style": "normal"
    },
    {
      "_key": "b2732eb27132",
      "_type": "image",
      "alt": "John J. Rofrano Sr. (1914–2001)",
      "asset": {
        "_ref": "image-70942dc9bf9532184a83b9dc7cf35fa4899ab0da-1800x1200-png",
        "_type": "reference"
      }
    },
    {
      "_key": "bc6e816c2772",
      "_type": "block",
      "children": [
        {
          "_key": "d7613bdeaa7d",
          "_type": "span",
          "text": "Honoring His Memory"
        }
      ],
      "style": "h2"
    },
    {
      "_key": "3cc360d0cf8a",
      "_type": "block",
      "children": [
        {
          "_key": "f63572b9b312",
          "_type": "span",
          "text": "His funeral was the most beautiful I had ever attended. Perhaps it was because he was my father or because his children, grandchildren, and nephew got up to eulogize him and tell him what he meant to them. Perhaps it was because his brother, Rev Peter J. Rofrano of Our Lady of Mount Carmel in NYC, said the Mass and gave a heartfelt eulogy about his brother."
        }
      ],
      "style": "normal"
    },
    {
      "_key": "8aadc5533380",
      "_type": "block",
      "children": [
        {
          "_key": "8d6b72745112",
          "_type": "span",
          "text": "It was satisfying to know that my father’s spirit will live on in the lives of so many. The photo on this page shows Father’s Day in June 2001. It’s the one I have posted on my refrigerator door and say hello to every morning. As you can see, he loved getting a tan. He was so full of life. We went to church together that morning and had a great day. It was the last time he came to my house."
        }
      ],
      "style": "normal"
    },
    {
      "_key": "11598458cd73",
      "_type": "block",
      "children": [
        {
          "_key": "c0dd791b2a4f",
          "_type": "span",
          "text": "The night he died was the Leonid meteor shower. As we left his room, we looked at the sky and saw shooting stars streaking through the heavens. It was as if this was Dad’s way of saying goodbye."
        }
      ],
      "style": "normal"
    },
    {
      "_key": "cf199dce38a7",
      "_type": "block",
      "children": [
        {
          "_key": "2d8cd692d1f7",
          "_type": "span",
          "text": "On January 23, 2006, my Mother joined my father, and now they are together again."
        }
      ],
      "style": "normal"
    },
    {
      "_key": "14307e65694a",
      "_type": "block",
      "children": [
        {
          "_key": "7d4e03cc429c",
          "_type": "span",
          "text": "Eulogy"
        }
      ],
      "style": "h2"
    },
    {
      "_key": "a1fa5fa1d0ab",
      "_type": "block",
      "children": [
        {
          "_key": "29225190c589",
          "_type": "span",
          "text": "Here is the eulogy that I gave to my father. While I did it from memory at the time, I decided to write it down here so I’d have it to refer to in the future:"
        }
      ],
      "style": "normal"
    },
    {
      "_key": "57b309bb9342",
      "_type": "block",
      "children": [
        {
          "_key": "85d2767efa5f",
          "_type": "span",
          "text": "My father would have been pleased to see his family and friends here today because he was very social. He loved being in the center of the action. He enjoyed his wine and his hot peppers and would never pass up a good meal. He enjoyed taking day trips with my aunts and uncles to find a new lobster restaurant or buffet. He loved being around people. Any excuse to get together and enjoy family and friends? Over the past two days, many people have told me how much they loved him. He was one of a kind, they would say. If a man’s wealth were to be measured by the love he receives, then my father was a wealthy man."
        }
      ],
      "style": "normal"
    },
    {
      "_key": "59c1e46dc48b",
      "_type": "block",
      "children": [
        {
          "_key": "5f266290da0b",
          "_type": "span",
          "text": "I remember my father always volunteering and encouraging us to volunteer. He was a member of the Lion’s Club and the Mount Carmel Church Club. He was the 8th ward republican leader and head of 14 districts. He always volunteered at the church. I recall growing up, everyone knew my father. It was tough going to a catholic school where everyone knew your dad. You couldn’t get away with anything. It was also very comforting growing up with everyone knowing my dad. It gave a sense of security and a feeling of extended family that was very reassuring. He was always willing to help. Not many people know this, but my father would collect the clothes we had outgrown and distribute them to the families on his insurance route who were less fortunate than us. If a man’s wealth were to be measured by charity to his community, then my father was wealthy."
        }
      ],
      "style": "normal"
    },
    {
      "_key": "cfdfa8c8f918",
      "_type": "block",
      "children": [
        {
          "_key": "7efccdea7508",
          "_type": "span",
          "text": "My father always told me to be honest. “Your word is your bond. It is all that you have”, he would say. “If people can’t trust your word, you have nothing.” “Never make a promise you don’t intend to keep.” And people knew that when John Rofrano said he would do something, it would get done. He was someone everyone trusted. If a man’s wealth were to be measured by integrity, then my father was wealthy."
        }
      ],
      "style": "normal"
    },
    {
      "_key": "6281c05466b0",
      "_type": "block",
      "children": [
        {
          "_key": "fadc4111a50e",
          "_type": "span",
          "text": "As my uncle, Rev. Peter Rofrano, pointed out, my father was also very religious. When we lived in Yonkers, I remember him attending daily Mass. Last year, when dealing with health worries, I attended daily Mass and was amazed by its calming effect on my day. Now I know how he felt. I encourage each of you to start your day with a morning Mass. It will reduce a lot of the stress in your life. My dad would also say the rosary daily. I think we found 14 pairs of rosaries around the house this week. If a man’s wealth were to be measured by faith in God, then my father was wealthy."
        }
      ],
      "style": "normal"
    },
    {
      "_key": "23902f3a8ebf",
      "_type": "block",
      "children": [
        {
          "_key": "1040c1d25797",
          "_type": "span",
          "text": "Loving and loved by others, charity to his community, integrity, and faith in God are the words that come to mind when I think of my father. I want to leave you with this thought. My father’s spirit will never die because a piece of who he was is at the core of who his children are. My sisters and I carry his spirit within us. May you rest in peace, Dad. Your work here is over, but your spirit lives on."
        }
      ],
      "style": "normal"
    }
  ],
  "changeFrequency": "monthly",
  "description": "In loving memory of John J. Rofrano Sr. (1914-2001), a devoted father, community volunteer, and man of integrity. Celebrate his life, his faith, and the love he shared with his family and friends.",
  "lastModified": "2025-05-29T12:58:48Z",
  "priority": 0.5,
  "slug": "johnrofranosr",
  "title": "John J. Rofrano Sr."
}